Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/gpio/netmf_gpio_old.cpp
    if(GPIO_INT_EDGE_LOW == IntEdge)
    	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
    else if(GPIO_INT_EDGE_HIGH == IntEdge)
    	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
    else if(GPIO_INT_EDGE_BOTH == IntEdge)
    	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
    // Not supported on the device
    else if(GPIO_INT_LEVEL_HIGH == IntEdge || GPIO_INT_LEVEL_LOW == IntEdge)
    	return FALSE;

    // Initialize external interrupts
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTI_InitStructure);

	if(PIN_ISR)
	{
		STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[Pin];

		pinIsr.m_isr     = PIN_ISR;
		pinIsr.m_param   = ISR_Param;
		pinIsr.m_intEdge = IntEdge;

		CPU_INTC_ActivateInterrupt(GPIO_GetIRQNumber(Pin), (HAL_CALLBACK_FPN) GPIO_GetCallBack(Pin), NULL);
	}

	return TRUE;
}

// Return the state of the pin
// In case the pin is configured as one of the input modes, read the input data register.
// If the pin is configured in one of the output modes, read the output data register
BOOL CPU_GPIO_GetPinState( GPIO_PIN Pin )
{
	if((GPIO_Instances[Pin].GPIO_Mode == GPIO_Mode_AIN) || (GPIO_Instances[Pin].GPIO_Mode == GPIO_Mode_IN_FLOATING) || (GPIO_Instances[Pin].GPIO_Mode == GPIO_Mode_IPD) || (GPIO_Instances[Pin].GPIO_Mode == GPIO_Mode_IPU))
		return (BOOL)GPIO_ReadInputDataBit(GPIO_GetPortPtr(Pin), GPIO_GetPin(Pin));
	else
		return (BOOL)GPIO_ReadOutputDataBit(GPIO_GetPortPtr(Pin), GPIO_GetPin(Pin));
}

void CPU_GPIO_SetPinState( GPIO_PIN Pin, BOOL PinState )
{
	if(PinState) {
		GPIO_WriteBit(GPIO_GetPortPtr(Pin), GPIO_GetPin(Pin), Bit_SET);
	}else {
		GPIO_WriteBit(GPIO_GetPortPtr(Pin), GPIO_GetPin(Pin), Bit_RESET);
	}
}

BOOL CPU_GPIO_PinIsBusy( GPIO_PIN Pin )
{
    return (BOOL)READ_BIT(GPIO_Reserve[GPIO_GetPort(Pin)], (0x1 << GPIO_GetPin(Pin)));
}

BOOL CPU_GPIO_ReservePin( GPIO_PIN Pin, BOOL fReserve )
{
    if(fReserve) {
		SET_BIT(GPIO_Reserve[GPIO_GetPort(Pin)], (0x1 << GPIO_GetPin(Pin)));
	}else {
		CLEAR_BIT(GPIO_Reserve[GPIO_GetPort(Pin)], (0x1 << GPIO_GetPin(Pin)));
	}
}

//STUB
UINT32 CPU_GPIO_GetDebounce()
{
    return 0;
}

//STUB
BOOL CPU_GPIO_SetDebounce( INT64 debounceTimeMilliseconds )
{
    return FALSE;
}

INT32 CPU_GPIO_GetPinCount()
{
    return g_STM32F10x_Gpio_Driver.c_MaxPins;
} 

void CPU_GPIO_GetPinsMap( UINT8* pins, size_t size )
{
    UINT8 ik;
	for(ik = 0; ik < size; ik++) {
		pins[ik] = (UINT8)CPU_GPIO_Attributes((GPIO_PIN)ik);
	}
}

UINT8 CPU_GPIO_GetSupportedResistorModes( GPIO_PIN Pin )
{
	return g_STM32F10x_Gpio_Driver.c_GPIO_ResistorMode;

}
UINT8 CPU_GPIO_GetSupportedInterruptModes( GPIO_PIN pin )
{
    return g_STM32F10x_Gpio_Driver.c_GPIO_InterruptMode;
}

void EXTI1_IRQ_HANDLER(void *args)
{
	if(EXTI_GetITStatus(EXTI_Line1) != RESET)
	{
		EXTI_ClearITPendingBit(EXTI_Line1);
		for(UINT32 pin = 1; pin < g_STM32F10x_Gpio_Driver.c_MaxPins; pin = pin + g_STM32F10x_Gpio_Driver.c_PinsPerPort)
		{
			if(GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin), GPIO_GetPin(pin)) && (g_STM32F10x_Gpio_Driver.m_pinIsr[pin].m_intEdge != GPIO_INT_NONE))
			{

				STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];
				if(pinIsr.m_isr)
				  pinIsr.m_isr(pin, TRUE,  args);
			}
		}
	}

}

extern "C"
{

void EXTI0_IRQ_HANDLER(void *args)
{
  if(EXTI_GetITStatus(EXTI_Line0) != RESET)
  {
	  EXTI_ClearITPendingBit(EXTI_Line0);

	  for(UINT32 pin = 0; pin < g_STM32F10x_Gpio_Driver.c_MaxPins; pin = pin + g_STM32F10x_Gpio_Driver.c_PinsPerPort)
	  {
		  if(GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin), GPIO_GetPin(pin)) && (g_STM32F10x_Gpio_Driver.m_pinIsr[pin].m_intEdge != GPIO_INT_NONE))
		  {

			  STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];
			  if(pinIsr.m_isr)
				  pinIsr.m_isr(pin, TRUE,  args);
		  }
	  }

  }
}



extern "C"
{
void Default_EXTI_Handler(void *data)
{

}
}

void EXTI2_IRQ_HANDLER(void *args)
{
	if(EXTI_GetITStatus(EXTI_Line2) != RESET)
	{

		EXTI_ClearITPendingBit(EXTI_Line2);

		 for(UINT32 pin = 2; pin < g_STM32F10x_Gpio_Driver.c_MaxPins; pin = pin + g_STM32F10x_Gpio_Driver.c_PinsPerPort)
         {
			  if(GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin), GPIO_GetPin(pin)) && (g_STM32F10x_Gpio_Driver.m_pinIsr[pin].m_intEdge != GPIO_INT_NONE))
			  {
				  STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];
				  if(pinIsr.m_isr)
					  pinIsr.m_isr(pin, TRUE,  args);
			  }
	     }

	}

}

void EXTI3_IRQ_HANDLER(void *args)
{
	if(EXTI_GetITStatus(EXTI_Line3) != RESET)
	{

		EXTI_ClearITPendingBit(EXTI_Line3);

		 for(UINT32 pin = 3; pin < g_STM32F10x_Gpio_Driver.c_MaxPins; pin = pin + g_STM32F10x_Gpio_Driver.c_PinsPerPort)
		 {
			  if(GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin), GPIO_GetPin(pin)) && (g_STM32F10x_Gpio_Driver.m_pinIsr[pin].m_intEdge != GPIO_INT_NONE))
			  {
				  STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];
				  if(pinIsr.m_isr)
				  pinIsr.m_isr(pin, TRUE,  args);
			  }
		  }
	}
}

void EXTI4_IRQ_HANDLER(void *args)
{
	if(EXTI_GetITStatus(EXTI_Line4) != RESET)
	{
		EXTI_ClearITPendingBit(EXTI_Line4);
		//Handles only PA4
		for(UINT32 pin = 4; pin < g_STM32F10x_Gpio_Driver.c_MaxPins; pin = pin + g_STM32F10x_Gpio_Driver.c_PinsPerPort)
		 {
			  if(GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin), GPIO_GetPin(pin)) && (g_STM32F10x_Gpio_Driver.m_pinIsr[pin].m_intEdge != GPIO_INT_NONE))
			  {
				  STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];
				  if(pinIsr.m_isr)
					  pinIsr.m_isr(pin, TRUE,  args);
			  }
		}
	}


}

void EXTI9_5_IRQ_HANDLER(void *args)
{
	if(EXTI_GetITStatus(EXTI_Line5) != RESET)
	{
		EXTI_ClearITPendingBit(EXTI_Line5);

		for(UINT32 pin = 5; pin < g_STM32F10x_Gpio_Driver.c_MaxPins; pin = pin + g_STM32F10x_Gpio_Driver.c_PinsPerPort)
		{
			  if(GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin), GPIO_GetPin(pin)) && (g_STM32F10x_Gpio_Driver.m_pinIsr[pin].m_intEdge != GPIO_INT_NONE))
			  {
				  STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];
				  if(pinIsr.m_isr)
					  pinIsr.m_isr(pin, TRUE,  args);
			  }
		}

