Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/gpio/netmf_gpio_old.cpp
	}
	else if(EXTI_GetITStatus(EXTI_Line6) != RESET)
	{
		EXTI_ClearITPendingBit(EXTI_Line6);
		//Handles only PC6
		for(UINT32 pin = 6; pin < g_STM32F10x_Gpio_Driver.c_MaxPins; pin = pin + g_STM32F10x_Gpio_Driver.c_PinsPerPort)
		{
			  if(GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin), GPIO_GetPin(pin)) && (g_STM32F10x_Gpio_Driver.m_pinIsr[pin].m_intEdge != GPIO_INT_NONE))
		      {
				  STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];
			      if(pinIsr.m_isr)
			    	  pinIsr.m_isr(pin, TRUE,  args);
			  }
		}
	}
	else if(EXTI_GetITStatus(EXTI_Line7) != RESET)
	{
		EXTI_ClearITPendingBit(EXTI_Line7);

		for(UINT32 pin = 7; pin < g_STM32F10x_Gpio_Driver.c_MaxPins; pin = pin + g_STM32F10x_Gpio_Driver.c_PinsPerPort)
		{
			  if(GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin), GPIO_GetPin(pin)) && (g_STM32F10x_Gpio_Driver.m_pinIsr[pin].m_intEdge != GPIO_INT_NONE))
		      {
				  STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];
			      if(pinIsr.m_isr)
			    	  pinIsr.m_isr(pin, TRUE,  args);
			  }
		}
	}
	else if(EXTI_GetITStatus(EXTI_Line8) != RESET)
	{
		EXTI_ClearITPendingBit(EXTI_Line8);

		for(UINT32 pin = 8; pin < g_STM32F10x_Gpio_Driver.c_MaxPins; pin = pin + g_STM32F10x_Gpio_Driver.c_PinsPerPort)
		{
			  if(GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin), GPIO_GetPin(pin)) && (g_STM32F10x_Gpio_Driver.m_pinIsr[pin].m_intEdge != GPIO_INT_NONE))
		      {
				  STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];
			      if(pinIsr.m_isr)
			    	  pinIsr.m_isr(pin, TRUE,  args);
			  }
		}

	}
	else if(EXTI_GetITStatus(EXTI_Line9) != RESET)
	{
		EXTI_ClearITPendingBit(EXTI_Line9);

		for(UINT32 pin = 9; pin < g_STM32F10x_Gpio_Driver.c_MaxPins; pin = pin + g_STM32F10x_Gpio_Driver.c_PinsPerPort)
		{
			  if(GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin), GPIO_GetPin(pin)) && (g_STM32F10x_Gpio_Driver.m_pinIsr[pin].m_intEdge != GPIO_INT_NONE))
		      {
				  STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];
			      if(pinIsr.m_isr)
			    	  pinIsr.m_isr(pin, TRUE,  args);
			  }
		}

	}

}

void EXTI15_10_IRQ_Handler(void *args)
{
	if(EXTI_GetITStatus(EXTI_Line10) != RESET)
		{
			EXTI_ClearITPendingBit(EXTI_Line10);

			for(UINT32 pin = 10; pin < g_STM32F10x_Gpio_Driver.c_MaxPins; pin = pin + g_STM32F10x_Gpio_Driver.c_PinsPerPort)
			{
				  if(GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin), GPIO_GetPin(pin)) && (g_STM32F10x_Gpio_Driver.m_pinIsr[pin].m_intEdge != GPIO_INT_NONE))
			      {
					  STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];
				      if(pinIsr.m_isr)
				    	  pinIsr.m_isr(pin, TRUE,  args);
				  }
			}

		}
		else if(EXTI_GetITStatus(EXTI_Line11) != RESET)
		{
			EXTI_ClearITPendingBit(EXTI_Line11);

			for(UINT32 pin = 11; pin < g_STM32F10x_Gpio_Driver.c_MaxPins; pin = pin + g_STM32F10x_Gpio_Driver.c_PinsPerPort)
			{
				  if(GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin), GPIO_GetPin(pin)) && (g_STM32F10x_Gpio_Driver.m_pinIsr[pin].m_intEdge != GPIO_INT_NONE))
			      {
					  STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];
				      if(pinIsr.m_isr)
				    	  pinIsr.m_isr(pin, TRUE,  args);
				  }
			}
		}
		else if(EXTI_GetITStatus(EXTI_Line12) != RESET)
		{
			EXTI_ClearITPendingBit(EXTI_Line12);

			for(UINT32 pin = 12; pin < g_STM32F10x_Gpio_Driver.c_MaxPins; pin = pin + g_STM32F10x_Gpio_Driver.c_PinsPerPort)
			{
				  if(GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin), GPIO_GetPin(pin)) && (g_STM32F10x_Gpio_Driver.m_pinIsr[pin].m_intEdge != GPIO_INT_NONE))
			      {
					  STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];
				      if(pinIsr.m_isr)
				    	  pinIsr.m_isr(pin, TRUE,  args);
				  }
			}

		}
		else if(EXTI_GetITStatus(EXTI_Line13) != RESET)
		{
			EXTI_ClearITPendingBit(EXTI_Line13);

			for(UINT32 pin = 13; pin < g_STM32F10x_Gpio_Driver.c_MaxPins; pin = pin + g_STM32F10x_Gpio_Driver.c_PinsPerPort)
			{
				  if(GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin), GPIO_GetPin(pin)) && (g_STM32F10x_Gpio_Driver.m_pinIsr[pin].m_intEdge != GPIO_INT_NONE))
			      {
					  STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];
				      if(pinIsr.m_isr)
				    	  pinIsr.m_isr(pin, TRUE,  args);
				  }
			}

		}
		else if(EXTI_GetITStatus(EXTI_Line14) != RESET)
		{
			EXTI_ClearITPendingBit(EXTI_Line14);

			for(UINT32 pin = 14; pin < g_STM32F10x_Gpio_Driver.c_MaxPins; pin = pin + g_STM32F10x_Gpio_Driver.c_PinsPerPort)
			{
				  if(GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin), GPIO_GetPin(pin)) && (g_STM32F10x_Gpio_Driver.m_pinIsr[pin].m_intEdge != GPIO_INT_NONE))
			      {
					  STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];
				      if(pinIsr.m_isr)
				    	  pinIsr.m_isr(pin, TRUE,  args);
				  }
			}

		}
		else if(EXTI_GetITStatus(EXTI_Line15) != RESET)
		{
			EXTI_ClearITPendingBit(EXTI_Line15);

			for(UINT32 pin = 15; pin < g_STM32F10x_Gpio_Driver.c_MaxPins; pin = pin + g_STM32F10x_Gpio_Driver.c_PinsPerPort)
			{
				  if(GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin), GPIO_GetPin(pin)) && (g_STM32F10x_Gpio_Driver.m_pinIsr[pin].m_intEdge != GPIO_INT_NONE))
			      {
					  STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];
				      if(pinIsr.m_isr)
				    	  pinIsr.m_isr(pin, TRUE,  args);
				  }
			}
		}


}
}

void STUB_GPIOISRVector( GPIO_PIN Pin, BOOL PinState, void* Param )
{

}


